{
  "nodes": [
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "64", 
        "pad": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "64", 
        "pad": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "64", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attrs": {
        "kernel": "(4, 4)", 
        "pool_type": "max", 
        "stride": "(4, 4)"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn1_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn1", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0], [9, 0, 1], [10, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "100", 
        "pad": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "100", 
        "pad": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "100", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2", 
      "attrs": {
        "kernel": "(8, 8)", 
        "pool_type": "max", 
        "stride": "(8, 8)"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten", 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0], [20, 0, 1], [21, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "fc1_weight", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc1", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn4_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn4", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 1], [30, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "out_weight", 
      "attrs": {"num_hidden": "20"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "out_bias", 
      "attrs": {"num_hidden": "20"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "out", 
      "attrs": {"num_hidden": "20"}, 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax", 
      "attrs": {"axis": "1"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "log", 
      "name": "log3", 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul3", 
      "inputs": [[0, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminus_scalar3", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "cross_entropy_custom", 
      "inputs": [[38, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    3, 
    7, 
    8, 
    9, 
    10, 
    12, 
    13, 
    18, 
    19, 
    20, 
    21, 
    23, 
    24, 
    27, 
    28, 
    29, 
    30, 
    32, 
    33
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46
  ], 
  "heads": [[39, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10300]}
}